'''
많은 양의 데이터를 분석할 때는 데이터 값 자체를 살펴보기보다는 이를 그래프나 차트 형태로 그려보는 것이 큰 도움이 될 때가 많습니다. 예를 들어, 주식 투자자들도 주식 데이터를 분석할 때 여러 거래일의 시가, 종가, 고가, 저가의 수치를 일일이 살펴보지는 않습니다. 대신 HTS가 제공하는 봉 차트를 살펴봄으로써 전체적인 추세를 확인합니다.

파이썬을 사용하면 HTS가 제공하는 다양한 차트들을 여러분들도 쉽게 그릴 수 있습니다. 파이썬은 데이터 시각화를 위한 다양한 라이브러리를 제공하고 있는데, 이번장에서는 그 중 matplotlib라는 라이브러리에 대해 다룰 예정입니다.

matplotlib는 파이썬에서 2차원 그래프를 그릴 때 가장 널리 사용되고 있는 라이브러리입니다. 특히 출판물에 사용할 정도의 품질로 도표를 쉽게 만들 수 있어 과학이나 공학 분야에서도 자주 사용됩니다. matplotlib 라이브러리에 대해서 익혀둔다면 주식 투자 외에도 다양한 분야에서 이를 활용할 수 있을 것입니다.
'''